{"pageProps":{"parable":{"id":"unmerciful-servant","title":"Parable of the Unmerciful Servant","bibleReference":{"book":"Matthew","chapter":18,"verse":"23-35"},"categories":["forgiveness","mercy","judgment"],"tags":["parables of jesus","kingdom of heaven","grace"],"testament":"new","biblicalText":"\"Therefore, the kingdom of heaven is like a king who wanted to settle accounts with his servants. As he began the settlement, a man who owed him ten thousand bags of gold was brought to him. Since he was not able to pay, the master ordered that he and his wife and his children and all that he had be sold to repay the debt.\n\nAt this the servant fell on his knees before him. 'Be patient with me,' he begged, 'and I will pay back everything.' The servant's master took pity on him, canceled the debt and let him go.\n\nBut when that servant went out, he found one of his fellow servants who owed him a hundred silver coins. He grabbed him and began to choke him. 'Pay back what you owe me!' he demanded.\n\nHis fellow servant fell to his knees and begged him, 'Be patient with me, and I will pay it back.'\n\nBut he refused. Instead, he went off and had the man thrown into prison until he could pay the debt. When the other servants saw what had happened, they were outraged and went and told their master everything that had happened.\n\nThen the master called the servant in. 'You wicked servant,' he said, 'I canceled all that debt of yours because you begged me to. Shouldn't you have had mercy on your fellow servant just as I had on you?'\"\n\n— Matthew 18:23-33 (NIV)","context":"Jesus told this parable in response to Peter's question about how many times he should forgive someone who sins against him. It illustrates Jesus' teaching that we should forgive others as God has forgiven us.","theologicalInterpretation":"This parable powerfully illustrates the vast difference between God's forgiveness of us and our reluctance to forgive others. The contrast between the enormous debt forgiven and the small debt withheld emphasizes the magnitude of God's mercy and the unreasonableness of withholding forgiveness from others.","practicalApplications":[{"title":"Divine Mercy","points":["God's forgiveness is immense","We are all debtors to grace","Mercy precedes obligation"]},{"title":"Human Response","points":["Forgiven people should forgive","Gratitude shown through action","Remembering our own debt"]},{"title":"Serious Consequences","points":["Unforgiveness has grave results","God expects mercy from the mercied","Our actions reveal our hearts"]}],"keyTakeaways":["God's forgiveness far exceeds what we're asked to forgive","Receiving mercy obligates us to show mercy","Unforgiveness brings serious consequences"],"relatedParables":[{"id":"two-debtors","title":"The Two Debtors","reference":"Luke 7:41-43","theme":"forgiveness and gratitude"},{"id":"prodigal-son","title":"The Prodigal Son","reference":"Luke 15:11-32","theme":"mercy and restoration"},{"id":"good-samaritan","title":"The Good Samaritan","reference":"Luke 10:25-37","theme":"showing mercy"}]}},"__N_SSG":true}