{"pageProps":{"category":"eternity","parables":[{"id":"rich-man-lazarus","title":"Parable of the Rich Man and Lazarus","bibleReference":{"book":"Luke","chapter":16,"verse":"19-31"},"categories":["wealth","eternity","compassion"],"tags":["parables of jesus","judgment","stewardship"],"testament":"new","biblicalText":"\"There was a rich man who was dressed in purple and fine linen and lived in luxury every day. At his gate was laid a poor man named Lazarus, covered with sores and longing to eat what fell from the rich man's table. Even the dogs came and licked his sores.\n\nThe time came when the beggar died and the angels carried him to Abraham's side. The rich man also died and was buried. In Hades, where he was in torment, he looked up and saw Abraham far away, with Lazarus by his side.\n\nSo he called to him, 'Father Abraham, have pity on me and send Lazarus to dip the tip of his finger in water and cool my tongue, because I am in agony in this fire.'\n\nBut Abraham replied, 'Son, remember that in your lifetime you received your good things, while Lazarus received bad things, but now he is comforted here and you are in agony. And besides all this, between us and you a great chasm has been set in place, so that those who want to go from here to you cannot, nor can anyone cross over from there to us.'\n\nHe answered, 'Then I beg you, father, send Lazarus to my family, for I have five brothers. Let him warn them, so that they will not also come to this place of torment.'\n\nAbraham replied, 'They have Moses and the Prophets; let them listen to them.'\n\n'No, father Abraham,' he said, 'but if someone from the dead goes to them, they will repent.'\n\nHe said to him, 'If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.'\"\n\n— Luke 16:19-31 (NIV)","context":"Jesus told this parable to the Pharisees who loved money and were sneering at His teachings about wealth. It follows His teachings about faithful stewardship and the impossibility of serving both God and money.","theologicalInterpretation":"This parable illustrates the eternal consequences of how we use our resources and treat others. It challenges the common assumption that wealth indicates God's favor, while emphasizing the finality of death and the importance of responding to God's word in this life.","practicalApplications":[{"title":"Stewardship of Wealth","points":["Material wealth carries spiritual responsibility","Earthly comfort doesn't indicate divine approval","Resources should be used to help others"]},{"title":"Present Choices, Eternal Consequences","points":["Life's decisions have lasting impact","Death fixes our eternal destiny","No second chances after death"]},{"title":"Scripture's Sufficiency","points":["God's Word provides adequate warning","Miraculous signs don't guarantee belief","The importance of heeding Scripture now"]}],"keyTakeaways":["Wealth brings responsibility toward others","Current choices determine eternal destiny","God's Word provides sufficient guidance for life"],"relatedParables":[{"id":"rich-fool","title":"The Rich Fool","reference":"Luke 12:16-21","theme":"wealth and eternity"},{"id":"unjust-steward","title":"The Unjust Steward","reference":"Luke 16:1-13","theme":"faithful stewardship"},{"id":"good-samaritan","title":"The Good Samaritan","reference":"Luke 10:25-37","theme":"practical compassion"}]}]},"__N_SSG":true}