{"pageProps":{"parable":{"id":"good-samaritan","title":"The Good Samaritan","bibleReference":{"book":"Luke","chapter":10,"verse":"25-37"},"categories":["love","mercy","neighborliness"],"tags":["parables of jesus","compassion","service"],"testament":"new","biblicalText":"On one occasion an expert in the law stood up to test Jesus. \"Teacher,\" he asked, \"what must I do to inherit eternal life?\"\n\n\"What is written in the Law?\" he replied. \"How do you read it?\"\n\nHe answered, \"'Love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind'; and, 'Love your neighbor as yourself.'\"\n\n\"You have answered correctly,\" Jesus replied. \"Do this and you will live.\"\n\nBut he wanted to justify himself, so he asked Jesus, \"And who is my neighbor?\"\n\nIn reply Jesus said: \"A man was going down from Jerusalem to Jericho, when he was attacked by robbers. They stripped him of his clothes, beat him and went away, leaving him half dead. A priest happened to be going down the same road, and when he saw the man, he passed by on the other side. So too, a Levite, when he came to the place and saw him, passed by on the other side. But a Samaritan, as he traveled, came where the man was; and when he saw him, he took pity on him. He went to him and bandaged his wounds, pouring on oil and wine. Then he put the man on his own donkey, brought him to an inn and took care of him. The next day he took out two denarii and gave them to the innkeeper. 'Look after him,' he said, 'and when I return, I will reimburse you for any extra expense you may have.'\"\n\n— Luke 10:25-35 (NIV)","context":"Jesus told this parable in response to a legal expert who wanted to justify himself by narrowly defining who qualified as his \"neighbor.\" The story deliberately uses a Samaritan, who would have been despised by Jesus' Jewish audience, as the hero.","theologicalInterpretation":"This parable redefines the concept of \"neighbor\" and demonstrates true love that transcends social, racial, and religious boundaries. It challenges the notion that we can limit our compassion to those who are like us or those we deem worthy of help.","practicalApplications":[{"title":"Active Compassion","points":["Love requires practical action","Compassion may be costly and inconvenient","True help meets real needs"]},{"title":"Breaking Social Barriers","points":["Love transcends cultural boundaries","Service knows no prejudice","Actions speak louder than social status"]},{"title":"Going Beyond Duty","points":["Providing thorough care","Following through on commitments","Taking personal responsibility"]}],"keyTakeaways":["True neighborliness is shown through actions, not defined by boundaries","Religious position doesn't guarantee godly behavior","Love involves sacrifice and practical help"],"relatedParables":[{"id":"unmerciful-servant","title":"The Unmerciful Servant","reference":"Matthew 18:23-35","theme":"showing mercy"},{"id":"sheep-and-goats","title":"The Sheep and Goats","reference":"Matthew 25:31-46","theme":"practical service"},{"id":"rich-man-and-lazarus","title":"The Rich Man and Lazarus","reference":"Luke 16:19-31","theme":"compassion for others"}]}},"__N_SSG":true}