{"pageProps":{"parable":{"id":"trees-parable","title":"Jotham's Parable of the Trees","bibleReference":{"book":"Judges","chapter":9,"verse":"7-15"},"categories":["leadership","pride","wisdom"],"tags":["jotham","politics","authority"],"testament":"old","biblicalText":"When Jotham was told about this, he climbed up on the top of Mount Gerizim and shouted to them:\n\n\"Listen to me, citizens of Shechem, so that God may listen to you. One day the trees went out to anoint a king for themselves. They said to the olive tree, 'Be our king.'\n\nBut the olive tree answered, 'Should I give up my oil, by which both gods and humans are honored, to hold sway over the trees?'\n\nNext, the trees said to the fig tree, 'Come and be our king.'\n\nBut the fig tree replied, 'Should I give up my fruit, so good and sweet, to hold sway over the trees?'\n\nThen the trees said to the vine, 'Come and be our king.'\n\nBut the vine answered, 'Should I give up my wine, which cheers both gods and humans, to hold sway over the trees?'\n\nFinally all the trees said to the thornbush, 'Come and be our king.'\n\nThe thornbush said to the trees, 'If you really want to anoint me king over you, come and take refuge in my shade; but if not, then let fire come out of the thornbush and consume the cedars of Lebanon!'\"\n\n— Judges 9:7-15 (NIV)","context":"Jotham delivered this parable after his brother Abimelech killed their other brothers to seize power. The parable warns about the dangers of choosing an unworthy leader and the consequences of poor leadership choices.","theologicalInterpretation":"This parable addresses the nature of leadership and the dangers of choosing unworthy leaders, while also warning about the responsibilities of authority.\n\nThe parable shows how worthy leaders often don't seek power, while those unqualified eagerly grasp it. The productive trees (olive, fig, vine) represent those who serve society through their gifts, while the thornbush represents those who seek power without having anything valuable to offer.","practicalApplications":[],"keyTakeaways":["Leadership requires sacrifice","Power can corrupt","The importance of discernment in choosing leaders","Those most qualified often least desire power","Poor leadership choices bring destructive consequences","True leadership involves serving, not dominating"],"relatedParables":[{"id":"lion-s-cubs","title":"The Lion's Cubs","reference":"Ezekiel 19","theme":"leadership"},{"id":"cedar-tree","title":"The Cedar Tree","reference":"Ezekiel 31","theme":"pride in authority"},{"id":"two-eagles","title":"The Two Eagles","reference":"Ezekiel 17","theme":"political power"}]}},"__N_SSG":true}