{"pageProps":{"parable":{"id":"two-eagles","title":"Parable of the Two Eagles","bibleReference":{"book":"Ezekiel","chapter":17,"verse":"1-10"},"categories":["judgment","kingdoms","faithfulness"],"tags":["old testament parables","prophecy","allegory"],"testament":"old","biblicalText":"The word of the Lord came to me: \"Son of man, set forth an allegory and tell it to the Israelites as a parable. Say to them, 'This is what the Sovereign Lord says: A great eagle with powerful wings, long feathers and full plumage of varied colors came to Lebanon. Taking hold of the top of a cedar, he broke off its topmost shoot and carried it away to a land of merchants, where he planted it in a city of traders.\n\nHe took one of the seedlings of the land and put it in fertile soil. He planted it like a willow by abundant water, and it sprouted and became a low, spreading vine. Its branches turned toward him, but its roots remained under it. So it became a vine and produced branches and put out leafy boughs.\n\nBut there was another great eagle with powerful wings and full plumage. The vine now sent out its roots toward him from the plot where it was planted and stretched out its branches to him for water. It had been planted in good soil by abundant water so that it would produce branches, bear fruit and become a splendid vine.'\"\n\n— Ezekiel 17:1-8 (NIV)","context":"Ezekiel delivered this parable during the Babylonian exile to explain Judah's political situation and coming judgment. The allegory describes King Nebuchadnezzar's dealings with Jerusalem and its kings, particularly regarding King Zedekiah's rebellion.","theologicalInterpretation":"This parable illustrates God's sovereignty over nations and the consequences of breaking covenants. It demonstrates how political unfaithfulness often parallels spiritual unfaithfulness, both of which bring divine judgment.","practicalApplications":[{"title":"Covenant Faithfulness","points":["Keeping commitments matters to God","Breaking vows has consequences","Trust in God's sovereignty"]},{"title":"Political Wisdom","points":["Nations are under God's authority","Alliances should honor God","Pride leads to downfall"]},{"title":"Divine Justice","points":["God oversees human affairs","Rebellion brings judgment","Faithfulness brings stability"]}],"keyTakeaways":["God sovereignly directs nations' affairs","Breaking covenants brings consequences","True security comes from faithfulness to God"],"relatedParables":[{"id":"cedar-tree","title":"The Cedar Tree","reference":"Ezekiel 31","theme":"pride and power"}]}},"__N_SSG":true}