{"pageProps":{"category":"conviction","parables":[{"id":"ewe-lamb","title":"Nathan's Parable of the Ewe Lamb","bibleReference":{"book":"2 Samuel","chapter":12,"verse":"1-4"},"categories":["justice","conviction","repentance"],"tags":["nathan","david","judgment"],"testament":"old","biblicalText":"> The Lord sent Nathan to David. When he came to him, he said, \"There were two men in a certain town, one rich and the other poor. The rich man had a very large number of sheep and cattle, but the poor man had nothing except one little ewe lamb he had bought. He raised it, and it grew up with him and his children. It shared his food, drank from his cup and even slept in his arms. It was like a daughter to him.\n>\n> \"Now a traveler came to the rich man, but the rich man refrained from taking one of his own sheep or cattle to prepare a meal for the traveler who had come to him. Instead, he took the ewe lamb that belonged to the poor man and prepared it for the one who had come to him.\"\n>\n> — 2 Samuel 12:1-4 (NIV)","context":"Nathan delivered this parable to King David after David's sin with Bathsheba and the arranged death of her husband Uriah. The parable was designed to help David see his own actions through a different lens.","theologicalInterpretation":"This parable was used by the prophet Nathan to confront King David about his sin with Bathsheba and against Uriah, demonstrating how God uses stories to convict hearts. The parable's power lies in its ability to bypass David's defenses and lead him to pronounce judgment on himself.","practicalApplications":[],"keyTakeaways":["God sees and judges injustice, even when committed by those in power","Self","judgment often differs from how we judge others","The role of prophetic confrontation in spiritual growth"],"relatedParables":[{"id":"unmerciful-servant","title":"The Unmerciful Servant","reference":"Matthew 18:23-35","theme":"justice and mercy"},{"id":"two-debtors","title":"The Two Debtors","reference":"Luke 7:41-43","theme":"forgiveness and self-recognition"}]}]},"__N_SSG":true}