{"pageProps":{"category":"father's love","parables":[{"id":"prodigal-son","title":"Parable of the Prodigal Son","bibleReference":{"book":"Luke","chapter":15,"verse":"11-32"},"categories":["forgiveness","repentance","father's love"],"tags":["parables of jesus","redemption","family"],"testament":"new","biblicalText":"Jesus continued: \"There was a man who had two sons. The younger one said to his father, 'Father, give me my share of the estate.' So he divided his property between them.\n\nNot long after that, the younger son got together all he had, set off for a distant country and there squandered his wealth in wild living. After he had spent everything, there was a severe famine in that whole country, and he began to be in need. So he went and hired himself out to a citizen of that country, who sent him to his fields to feed pigs. He longed to fill his stomach with the pods that the pigs were eating, but no one gave him anything.\n\nWhen he came to his senses, he said, 'How many of my father's hired servants have food to spare, and here I am starving to death! I will set out and go back to my father and say to him: Father, I have sinned against heaven and against you. I am no longer worthy to be called your son; make me like one of your hired servants.'\n\nSo he got up and went to his father. But while he was still a long way off, his father saw him and was filled with compassion for him; he ran to his son, threw his arms around him and kissed him.\n\nThe son said to him, 'Father, I have sinned against heaven and against you. I am no longer worthy to be called your son.'\n\nBut the father said to his servants, 'Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. Bring the fattened calf and kill it. Let's have a feast and celebrate. For this son of mine was dead and is alive again; he was lost and is found.' So they began to celebrate.\n\n— Luke 15:11-24 (NIV)","context":"This is the third and longest of Jesus' \"lost\" parables, following the Lost Sheep and Lost Coin. It provides the most detailed picture of God's heart for the lost and His joy in their return, while also addressing the attitude of the self-righteous through the elder brother's response.","theologicalInterpretation":"This parable powerfully illustrates God's unconditional love and forgiveness, the nature of true repentance, and the joy of restoration. The father's extravagant welcome represents God's grace, while the two sons represent different ways people can be spiritually lost - through rebellion or self-righteousness.","practicalApplications":[{"title":"God's Unconditional Love","points":["The father's constant watch for his son","Immediate acceptance without conditions","Celebration of return rather than punishment"]},{"title":"True Repentance","points":["Recognition of sin and its consequences","Humble acceptance of unworthiness","Willingness to return to the father"]},{"title":"The Heart of the Father","points":["Runs to meet returning sinners","Restores full sonship immediately","Celebrates restoration joyfully"]}],"keyTakeaways":["God's love remains constant despite our wandering","True repentance leads to complete restoration","God's grace exceeds our expectations"],"relatedParables":[{"id":"lost-sheep","title":"The Lost Sheep","reference":"Luke 15:3-7","theme":"seeking the lost"},{"id":"lost-coin","title":"The Lost Coin","reference":"Luke 15:8-10","theme":"rejoicing over the found"},{"id":"two-debtors","title":"The Two Debtors","reference":"Luke 7:41-43","theme":"forgiveness and gratitude"}]}]},"__N_SSG":true}