{"pageProps":{"category":"invitation","parables":[{"id":"wedding-feast","title":"Parable of the Wedding Feast","bibleReference":{"book":"Matthew","chapter":22,"verse":"1-14"},"categories":["invitation","judgment","preparation"],"tags":["parables of jesus","kingdom of heaven","salvation"],"testament":"new","biblicalText":"Jesus spoke to them again in parables, saying: \"The kingdom of heaven is like a king who prepared a wedding banquet for his son. He sent his servants to those who had been invited to the banquet to tell them to come, but they refused to come.\n\nThen he sent some more servants and said, 'Tell those who have been invited that I have prepared my dinner: My oxen and fattened cattle have been butchered, and everything is ready. Come to the wedding banquet.'\n\nBut they paid no attention and went off—one to his field, another to his business. The rest seized his servants, mistreated them and killed them. The king was enraged. He sent his army and destroyed those murderers and burned their city.\n\nThen he said to his servants, 'The wedding banquet is ready, but those I invited did not deserve to come. Go to the street corners and invite to the banquet anyone you find.' So the servants went out into the streets and gathered all the people they could find, both good and bad, and the wedding hall was filled with guests.\n\nBut when the king came in to see the guests, he noticed a man there who was not wearing wedding clothes. 'Friend,' he asked, 'how did you get in here without wedding clothes?' The man was speechless.\n\nThen the king told the attendants, 'Tie him hand and foot, and throw him outside, into the darkness, where there will be weeping and gnashing of teeth.' For many are invited, but few are chosen.\"\n\n— Matthew 22:1-14 (NIV)","context":"Jesus told this parable near the end of His ministry, following His triumphal entry into Jerusalem. It addresses the rejection of God's invitation by the religious leaders and the extension of the kingdom to others.","theologicalInterpretation":"This parable illustrates both God's generous invitation to His kingdom and the proper response required. It shows the tragic rejection by those first invited (Israel's leaders), the extension of the invitation to all, and the necessity of being properly prepared for God's kingdom.","practicalApplications":[{"title":"Divine Invitation","points":["God's invitation is generous","Many reject His offer","The invitation extends to all"]},{"title":"Proper Response","points":["Accepting isn't enough","Preparation is required","Appropriate \"dress\" matters"]},{"title":"Final Judgment","points":["Rejection has consequences","Appearance alone insufficient","God examines all guests"]}],"keyTakeaways":["God's invitation is both generous and demanding","Rejection of grace brings judgment","Proper preparation for God's kingdom is essential"],"relatedParables":[{"id":"great-banquet","title":"The Great Banquet","reference":"Luke 14:15-24","theme":"invitation"},{"id":"ten-virgins","title":"The Ten Virgins","reference":"Matthew 25:1-13","theme":"preparation"},{"id":"talents","title":"The Talents","reference":"Matthew 25:14-30","theme":"readiness"}]}]},"__N_SSG":true}