{"pageProps":{"category":"mercy","parables":[{"id":"good-samaritan","title":"The Good Samaritan","bibleReference":{"book":"Luke","chapter":10,"verse":"25-37"},"categories":["love","mercy","neighborliness"],"tags":["parables of jesus","compassion","service"],"testament":"new","biblicalText":"On one occasion an expert in the law stood up to test Jesus. \"Teacher,\" he asked, \"what must I do to inherit eternal life?\"\n\n\"What is written in the Law?\" he replied. \"How do you read it?\"\n\nHe answered, \"'Love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind'; and, 'Love your neighbor as yourself.'\"\n\n\"You have answered correctly,\" Jesus replied. \"Do this and you will live.\"\n\nBut he wanted to justify himself, so he asked Jesus, \"And who is my neighbor?\"\n\nIn reply Jesus said: \"A man was going down from Jerusalem to Jericho, when he was attacked by robbers. They stripped him of his clothes, beat him and went away, leaving him half dead. A priest happened to be going down the same road, and when he saw the man, he passed by on the other side. So too, a Levite, when he came to the place and saw him, passed by on the other side. But a Samaritan, as he traveled, came where the man was; and when he saw him, he took pity on him. He went to him and bandaged his wounds, pouring on oil and wine. Then he put the man on his own donkey, brought him to an inn and took care of him. The next day he took out two denarii and gave them to the innkeeper. 'Look after him,' he said, 'and when I return, I will reimburse you for any extra expense you may have.'\"\n\n— Luke 10:25-35 (NIV)","context":"Jesus told this parable in response to a legal expert who wanted to justify himself by narrowly defining who qualified as his \"neighbor.\" The story deliberately uses a Samaritan, who would have been despised by Jesus' Jewish audience, as the hero.","theologicalInterpretation":"This parable redefines the concept of \"neighbor\" and demonstrates true love that transcends social, racial, and religious boundaries. It challenges the notion that we can limit our compassion to those who are like us or those we deem worthy of help.","practicalApplications":[{"title":"Active Compassion","points":["Love requires practical action","Compassion may be costly and inconvenient","True help meets real needs"]},{"title":"Breaking Social Barriers","points":["Love transcends cultural boundaries","Service knows no prejudice","Actions speak louder than social status"]},{"title":"Going Beyond Duty","points":["Providing thorough care","Following through on commitments","Taking personal responsibility"]}],"keyTakeaways":["True neighborliness is shown through actions, not defined by boundaries","Religious position doesn't guarantee godly behavior","Love involves sacrifice and practical help"],"relatedParables":[{"id":"unmerciful-servant","title":"The Unmerciful Servant","reference":"Matthew 18:23-35","theme":"showing mercy"},{"id":"sheep-and-goats","title":"The Sheep and Goats","reference":"Matthew 25:31-46","theme":"practical service"},{"id":"rich-man-and-lazarus","title":"The Rich Man and Lazarus","reference":"Luke 16:19-31","theme":"compassion for others"}]},{"id":"lost-sheep","title":"Parable of the Lost Sheep","bibleReference":{"book":"Luke","chapter":15,"verse":"3-7"},"categories":["salvation","mercy","seeking"],"tags":["parables of jesus","redemption","god's love"],"testament":"new","biblicalText":"Then Jesus told them this parable: \"Suppose one of you has a hundred sheep and loses one of them. Doesn't he leave the ninety-nine in the open country and go after the lost sheep until he finds it?\n\nAnd when he finds it, he joyfully puts it on his shoulders and goes home. Then he calls his friends and neighbors together and says, 'Rejoice with me; I have found my lost sheep.'\n\nI tell you that in the same way there will be more rejoicing in heaven over one sinner who repents than over ninety-nine righteous persons who do not need to repent.\"\n\n— Luke 15:3-7 (NIV)","context":"Jesus shared this parable in response to the Pharisees and teachers of the law who were criticizing Him for welcoming and eating with sinners. It's the first in a series of three parables about God's heart for the lost.","theologicalInterpretation":"This parable reveals God's passionate pursuit of lost sinners and His great joy in their salvation. The shepherd's dedication to finding one lost sheep, even leaving the ninety-nine, demonstrates God's personal care for each individual and His commitment to seeking those who have strayed.","practicalApplications":[{"title":"Divine Initiative","points":["God actively seeks the lost","Every individual matters to God","Salvation begins with God's pursuit"]},{"title":"Sacrificial Love","points":["Seeking the lost requires effort","One is worth leaving the ninety","nine","Recovery brings great joy"]},{"title":"Community Celebration","points":["Salvation is cause for rejoicing","The community shares in God's joy","Heaven celebrates repentance"]}],"keyTakeaways":["God personally pursues those who are lost","Every individual has infinite worth to God","Repentance brings heavenly celebration"],"relatedParables":[{"id":"lost-coin","title":"The Lost Coin","reference":"Luke 15:8-10","theme":"diligent seeking"},{"id":"prodigal-son","title":"The Prodigal Son","reference":"Luke 15:11-32","theme":"joyful return"},{"id":"good-shepherd","title":"The Good Shepherd","reference":"John 10:1-18","theme":"shepherd's care"}]},{"id":"unmerciful-servant","title":"Parable of the Unmerciful Servant","bibleReference":{"book":"Matthew","chapter":18,"verse":"23-35"},"categories":["forgiveness","mercy","judgment"],"tags":["parables of jesus","kingdom of heaven","grace"],"testament":"new","biblicalText":"\"Therefore, the kingdom of heaven is like a king who wanted to settle accounts with his servants. As he began the settlement, a man who owed him ten thousand bags of gold was brought to him. Since he was not able to pay, the master ordered that he and his wife and his children and all that he had be sold to repay the debt.\n\nAt this the servant fell on his knees before him. 'Be patient with me,' he begged, 'and I will pay back everything.' The servant's master took pity on him, canceled the debt and let him go.\n\nBut when that servant went out, he found one of his fellow servants who owed him a hundred silver coins. He grabbed him and began to choke him. 'Pay back what you owe me!' he demanded.\n\nHis fellow servant fell to his knees and begged him, 'Be patient with me, and I will pay it back.'\n\nBut he refused. Instead, he went off and had the man thrown into prison until he could pay the debt. When the other servants saw what had happened, they were outraged and went and told their master everything that had happened.\n\nThen the master called the servant in. 'You wicked servant,' he said, 'I canceled all that debt of yours because you begged me to. Shouldn't you have had mercy on your fellow servant just as I had on you?'\"\n\n— Matthew 18:23-33 (NIV)","context":"Jesus told this parable in response to Peter's question about how many times he should forgive someone who sins against him. It illustrates Jesus' teaching that we should forgive others as God has forgiven us.","theologicalInterpretation":"This parable powerfully illustrates the vast difference between God's forgiveness of us and our reluctance to forgive others. The contrast between the enormous debt forgiven and the small debt withheld emphasizes the magnitude of God's mercy and the unreasonableness of withholding forgiveness from others.","practicalApplications":[{"title":"Divine Mercy","points":["God's forgiveness is immense","We are all debtors to grace","Mercy precedes obligation"]},{"title":"Human Response","points":["Forgiven people should forgive","Gratitude shown through action","Remembering our own debt"]},{"title":"Serious Consequences","points":["Unforgiveness has grave results","God expects mercy from the mercied","Our actions reveal our hearts"]}],"keyTakeaways":["God's forgiveness far exceeds what we're asked to forgive","Receiving mercy obligates us to show mercy","Unforgiveness brings serious consequences"],"relatedParables":[{"id":"two-debtors","title":"The Two Debtors","reference":"Luke 7:41-43","theme":"forgiveness and gratitude"},{"id":"prodigal-son","title":"The Prodigal Son","reference":"Luke 15:11-32","theme":"mercy and restoration"},{"id":"good-samaritan","title":"The Good Samaritan","reference":"Luke 10:25-37","theme":"showing mercy"}]}]},"__N_SSG":true}